In [1]:
#pandasのインポート
import pandas as pd

In [2]:
#csvをデータフレームとして読み込む
df = pd.read_csv("/Users/kato/Desktop/mypython/awesomebook-master/data/reserve.csv",encoding="utf-8")

In [57]:
df.head(3)

,reserve_id,hotel_id,customer_id,reserve_datetime,checkin_date,checkin_time,checkout_date,people_num,total_price
0,r1,h_75,c_1,2016-03-06 13:09:42,2016-03-26,10:00:00,2016-03-29,4,97200
1,r2,h_219,c_1,2016-07-16 23:39:55,2016-07-20,11:30:00,2016-07-21,2,20600
2,r3,h_179,c_1,2016-09-24 10:03:17,2016-10-19,09:00:00,2016-10-22,2,33600

In [58]:
#列名で列を絞り込む
df[["reserve_id","hotel_id","customer_id","reserve_datetime","checkin_date","checkin_time","checkout_date"]].head(3)

,reserve_id,hotel_id,customer_id,reserve_datetime,checkin_date,checkin_time,checkout_date
0,r1,h_75,c_1,2016-03-06 13:09:42,2016-03-26,10:00:00,2016-03-29
1,r2,h_219,c_1,2016-07-16 23:39:55,2016-07-20,11:30:00,2016-07-21
2,r3,h_179,c_1,2016-09-24 10:03:17,2016-10-19,09:00:00,2016-10-22

In [59]:
#query関数を使うと、列データの中で特定の条件を満たす行を抽出できる
df.query('"2016-10-13" <= checkout_date <= "2016-10-14"').head(3)

,reserve_id,hotel_id,customer_id,reserve_datetime,checkin_date,checkin_time,checkout_date,people_num,total_price
284,r285,h_121,c_67,2016-09-27 06:13:19,2016-10-12,12:00:00,2016-10-14,4,184000
513,r514,h_74,c_120,2016-10-06 03:12:04,2016-10-11,12:30:00,2016-10-14,2,28800
1065,r1066,h_205,c_261,2016-09-14 02:57:59,2016-10-11,10:00:00,2016-10-14,4,85200

In [60]:
# df.sample(n=100)　DF全体の中からランダムに100件のデータを抽出
# df.sample(frac=0.5) DF全体の中からランダムに50％のデータを抽出
df.sample(frac=0.5).head(3)

,reserve_id,hotel_id,customer_id,reserve_datetime,checkin_date,checkin_time,checkout_date,people_num,total_price
362,r363,h_7,c_84,2016-06-24 08:21:50,2016-07-02,11:30:00,2016-07-04,2,75600
2437,r2438,h_210,c_609,2017-03-04 01:20:23,2017-03-29,09:30:00,2017-04-01,3,87300
3409,r3410,h_153,c_851,2016-07-11 00:17:48,2016-07-21,09:00:00,2016-07-22,3,42300

In [61]:
#uniqueは重複を削除したcustomer_idを表示する
#Seriesはsample関数を使用するためにリストオブジェクトに変換しているだけ
#その中からcustomer_idを50％抜き出している
target = pd.Series(df["customer_id"].unique()).sample(frac=0.5)
target.head(3)

272    c_313
684    c_775
170    c_198
dtype: object

In [62]:
#isin関数によって、サンプリングしたcustomer_idと一致している行を抽出している
df[df["customer_id"].isin(target)].head(3)

,reserve_id,hotel_id,customer_id,reserve_datetime,checkin_date,checkin_time,checkout_date,people_num,total_price
0,r1,h_75,c_1,2016-03-06 13:09:42,2016-03-26,10:00:00,2016-03-29,4,97200
1,r2,h_219,c_1,2016-07-16 23:39:55,2016-07-20,11:30:00,2016-07-21,2,20600
2,r3,h_179,c_1,2016-09-24 10:03:17,2016-10-19,09:00:00,2016-10-22,2,33600

In [63]:
#dfに対して、groupbyでhotel_id毎に集計をできるようにし、
#さらにreserve_idの数をカウント、customer_idは重複を除いている？
result = df.groupby("hotel_id").agg({"reserve_id":"count", "customer_id":"nunique"}).head(3)

In [64]:
result

          reserve_id  customer_id
hotel_id
h_1               10           10
h_10               3            3
h_100             20           19

In [31]:
result.reset_index(inplace=True)
result.columns = ["hotel_id" , "rsv_cnt" , "cus_cnt"]

In [65]:
#dfをgroupby関数でhotel_idとpeople_numに絞り、インデックス番号を振り直した上で、total_priceを合計する
result2 = df.groupby(["hotel_id" , "people_num"])["total_price"].sum().reset_index() 
result2.head(3)

  hotel_id  people_num  total_price
0      h_1           1       156600
1      h_1           2       156600
2      h_1           3       391500

In [66]:
result3 = df.groupby(["hotel_id" , "people_num"])["total_price"].sum().reset_index()
result3.head(3)

  hotel_id  people_num  total_price
0      h_1           1       156600
1      h_1           2       156600
2      h_1           3       391500

In [67]:
#列の条件毎の合算値は一つの場合でもgroupbyを使用する
test = df.groupby(["hotel_id"])["total_price"].sum().reset_index()
test.head(3)

  hotel_id  total_price
0      h_1      1122300
1     h_10       128800
2    h_100       552000

In [74]:
#平均を出す
ave = df.groupby(["hotel_id"])["total_price"].mean().reset_index()
ave

    hotel_id    total_price
0        h_1  112230.000000
1       h_10   42933.333333
2      h_100   27600.000000
3      h_101   75764.705882
4      h_102   32769.230769
..       ...            ...
295     h_95  275815.384615
296     h_96   33015.384615
297     h_97   83600.000000
298     h_98   96723.529412
299     h_99  128000.000000

[300 rows x 2 columns]

In [78]:
df["total_price"].round(-3).mode()

0    10000
1    20000
2    40000
Name: total_price, dtype: int64